'''Идем вглубь
Добавьте с помощью метода append к списку, который содержит буквы, символ 'c'. Список L выводить не надо.'''

L = [[1, 2], ['a', 'b'], [5, 6]]
L[1].append('c')


'''Месячный бюджет

Ниже содержится список budget с бюджетами компании по годам и месяцам. Основная последовательность отвечает за годы, а вложенные списки за месяцы конкретного года, начиная с 2019.

Напишите программу, которая принимает из аргументов командной строки два параметра: год и номер месяца (1 - январь и т.д.), а затем выводит бюджет на этот месяц.
Пример использования:
> python program.py 2019 2
> 148
 '''




