'''Правильные переменные

Оставьте в программе только те переменные, которые имеют допустимые имена.'''

FirstName = 'Антон'
last_name = 'Иванов'
_age = 16

task17 = {'Название': 'Решить задачу'}

__x = 'Икс'

'''Что делает lower

Выведите с помощью функции print встроенную документацию к методу строк lower.'''

print(str.lower.__doc__)




